{
  "format": "layers-model",
  "generatedBy": "keras v2.5.0",
  "convertedBy": "TensorFlow.js Converter v3.8.0",
  "modelTopology": {
    "keras_version": "2.5.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "generator",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                256
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_2"
            },
            "name": "input_2",
            "inbound_nodes": []
          },
          {
            "class_name": "Reshape",
            "config": {
              "name": "reshape",
              "trainable": true,
              "dtype": "float32",
              "target_shape": [
                1,
                1,
                256
              ]
            },
            "name": "reshape",
            "inbound_nodes": [
              [
                [
                  "input_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d",
              "trainable": true,
              "dtype": "float32",
              "size": [
                4,
                4
              ],
              "data_format": "channels_last",
              "interpolation": "nearest"
            },
            "name": "up_sampling2d",
            "inbound_nodes": [
              [
                [
                  "reshape",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_15",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [
                4,
                4
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_15",
            "inbound_nodes": [
              [
                [
                  "up_sampling2d",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_15",
              "trainable": true,
              "dtype": "float32",
              "alpha": 0.20000000298023224
            },
            "name": "leaky_re_lu_15",
            "inbound_nodes": [
              [
                [
                  "conv2d_15",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.square",
              "trainable": true,
              "dtype": "float32",
              "function": "math.square"
            },
            "name": "tf.math.square",
            "inbound_nodes": [
              [
                "leaky_re_lu_15",
                0,
                0,
                {
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.reduce_mean",
              "trainable": true,
              "dtype": "float32",
              "function": "math.reduce_mean"
            },
            "name": "tf.math.reduce_mean",
            "inbound_nodes": [
              [
                "tf.math.square",
                0,
                0,
                {
                  "axis": 1,
                  "keepdims": true
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.__operators__.add",
              "trainable": true,
              "dtype": "float32",
              "function": "__operators__.add"
            },
            "name": "tf.__operators__.add",
            "inbound_nodes": [
              [
                "tf.math.reduce_mean",
                0,
                0,
                {
                  "y": 1e-08,
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.rsqrt",
              "trainable": true,
              "dtype": "float32",
              "function": "math.rsqrt"
            },
            "name": "tf.math.rsqrt",
            "inbound_nodes": [
              [
                "tf.__operators__.add",
                0,
                0,
                {}
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.multiply",
              "trainable": true,
              "dtype": "float32",
              "function": "math.multiply"
            },
            "name": "tf.math.multiply",
            "inbound_nodes": [
              [
                "leaky_re_lu_15",
                0,
                0,
                {
                  "y": [
                    "tf.math.rsqrt",
                    0,
                    0
                  ],
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_16",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_16",
            "inbound_nodes": [
              [
                [
                  "tf.math.multiply",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_16",
              "trainable": true,
              "dtype": "float32",
              "alpha": 0.20000000298023224
            },
            "name": "leaky_re_lu_16",
            "inbound_nodes": [
              [
                [
                  "conv2d_16",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.square_1",
              "trainable": true,
              "dtype": "float32",
              "function": "math.square"
            },
            "name": "tf.math.square_1",
            "inbound_nodes": [
              [
                "leaky_re_lu_16",
                0,
                0,
                {
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.reduce_mean_1",
              "trainable": true,
              "dtype": "float32",
              "function": "math.reduce_mean"
            },
            "name": "tf.math.reduce_mean_1",
            "inbound_nodes": [
              [
                "tf.math.square_1",
                0,
                0,
                {
                  "axis": 1,
                  "keepdims": true
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.__operators__.add_1",
              "trainable": true,
              "dtype": "float32",
              "function": "__operators__.add"
            },
            "name": "tf.__operators__.add_1",
            "inbound_nodes": [
              [
                "tf.math.reduce_mean_1",
                0,
                0,
                {
                  "y": 1e-08,
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.rsqrt_1",
              "trainable": true,
              "dtype": "float32",
              "function": "math.rsqrt"
            },
            "name": "tf.math.rsqrt_1",
            "inbound_nodes": [
              [
                "tf.__operators__.add_1",
                0,
                0,
                {}
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.multiply_1",
              "trainable": true,
              "dtype": "float32",
              "function": "math.multiply"
            },
            "name": "tf.math.multiply_1",
            "inbound_nodes": [
              [
                "leaky_re_lu_16",
                0,
                0,
                {
                  "y": [
                    "tf.math.rsqrt_1",
                    0,
                    0
                  ],
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d_1",
              "trainable": true,
              "dtype": "float32",
              "size": [
                2,
                2
              ],
              "data_format": "channels_last",
              "interpolation": "nearest"
            },
            "name": "up_sampling2d_1",
            "inbound_nodes": [
              [
                [
                  "tf.math.multiply_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_17",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_17",
            "inbound_nodes": [
              [
                [
                  "up_sampling2d_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_17",
              "trainable": true,
              "dtype": "float32",
              "alpha": 0.20000000298023224
            },
            "name": "leaky_re_lu_17",
            "inbound_nodes": [
              [
                [
                  "conv2d_17",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.square_2",
              "trainable": true,
              "dtype": "float32",
              "function": "math.square"
            },
            "name": "tf.math.square_2",
            "inbound_nodes": [
              [
                "leaky_re_lu_17",
                0,
                0,
                {
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.reduce_mean_2",
              "trainable": true,
              "dtype": "float32",
              "function": "math.reduce_mean"
            },
            "name": "tf.math.reduce_mean_2",
            "inbound_nodes": [
              [
                "tf.math.square_2",
                0,
                0,
                {
                  "axis": 1,
                  "keepdims": true
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.__operators__.add_2",
              "trainable": true,
              "dtype": "float32",
              "function": "__operators__.add"
            },
            "name": "tf.__operators__.add_2",
            "inbound_nodes": [
              [
                "tf.math.reduce_mean_2",
                0,
                0,
                {
                  "y": 1e-08,
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.rsqrt_2",
              "trainable": true,
              "dtype": "float32",
              "function": "math.rsqrt"
            },
            "name": "tf.math.rsqrt_2",
            "inbound_nodes": [
              [
                "tf.__operators__.add_2",
                0,
                0,
                {}
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.multiply_2",
              "trainable": true,
              "dtype": "float32",
              "function": "math.multiply"
            },
            "name": "tf.math.multiply_2",
            "inbound_nodes": [
              [
                "leaky_re_lu_17",
                0,
                0,
                {
                  "y": [
                    "tf.math.rsqrt_2",
                    0,
                    0
                  ],
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_18",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_18",
            "inbound_nodes": [
              [
                [
                  "tf.math.multiply_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_18",
              "trainable": true,
              "dtype": "float32",
              "alpha": 0.20000000298023224
            },
            "name": "leaky_re_lu_18",
            "inbound_nodes": [
              [
                [
                  "conv2d_18",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.square_3",
              "trainable": true,
              "dtype": "float32",
              "function": "math.square"
            },
            "name": "tf.math.square_3",
            "inbound_nodes": [
              [
                "leaky_re_lu_18",
                0,
                0,
                {
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.reduce_mean_3",
              "trainable": true,
              "dtype": "float32",
              "function": "math.reduce_mean"
            },
            "name": "tf.math.reduce_mean_3",
            "inbound_nodes": [
              [
                "tf.math.square_3",
                0,
                0,
                {
                  "axis": 1,
                  "keepdims": true
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.__operators__.add_3",
              "trainable": true,
              "dtype": "float32",
              "function": "__operators__.add"
            },
            "name": "tf.__operators__.add_3",
            "inbound_nodes": [
              [
                "tf.math.reduce_mean_3",
                0,
                0,
                {
                  "y": 1e-08,
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.rsqrt_3",
              "trainable": true,
              "dtype": "float32",
              "function": "math.rsqrt"
            },
            "name": "tf.math.rsqrt_3",
            "inbound_nodes": [
              [
                "tf.__operators__.add_3",
                0,
                0,
                {}
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.multiply_3",
              "trainable": true,
              "dtype": "float32",
              "function": "math.multiply"
            },
            "name": "tf.math.multiply_3",
            "inbound_nodes": [
              [
                "leaky_re_lu_18",
                0,
                0,
                {
                  "y": [
                    "tf.math.rsqrt_3",
                    0,
                    0
                  ],
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d_2",
              "trainable": true,
              "dtype": "float32",
              "size": [
                2,
                2
              ],
              "data_format": "channels_last",
              "interpolation": "nearest"
            },
            "name": "up_sampling2d_2",
            "inbound_nodes": [
              [
                [
                  "tf.math.multiply_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_19",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_19",
            "inbound_nodes": [
              [
                [
                  "up_sampling2d_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_19",
              "trainable": true,
              "dtype": "float32",
              "alpha": 0.20000000298023224
            },
            "name": "leaky_re_lu_19",
            "inbound_nodes": [
              [
                [
                  "conv2d_19",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.square_4",
              "trainable": true,
              "dtype": "float32",
              "function": "math.square"
            },
            "name": "tf.math.square_4",
            "inbound_nodes": [
              [
                "leaky_re_lu_19",
                0,
                0,
                {
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.reduce_mean_4",
              "trainable": true,
              "dtype": "float32",
              "function": "math.reduce_mean"
            },
            "name": "tf.math.reduce_mean_4",
            "inbound_nodes": [
              [
                "tf.math.square_4",
                0,
                0,
                {
                  "axis": 1,
                  "keepdims": true
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.__operators__.add_4",
              "trainable": true,
              "dtype": "float32",
              "function": "__operators__.add"
            },
            "name": "tf.__operators__.add_4",
            "inbound_nodes": [
              [
                "tf.math.reduce_mean_4",
                0,
                0,
                {
                  "y": 1e-08,
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.rsqrt_4",
              "trainable": true,
              "dtype": "float32",
              "function": "math.rsqrt"
            },
            "name": "tf.math.rsqrt_4",
            "inbound_nodes": [
              [
                "tf.__operators__.add_4",
                0,
                0,
                {}
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.multiply_4",
              "trainable": true,
              "dtype": "float32",
              "function": "math.multiply"
            },
            "name": "tf.math.multiply_4",
            "inbound_nodes": [
              [
                "leaky_re_lu_19",
                0,
                0,
                {
                  "y": [
                    "tf.math.rsqrt_4",
                    0,
                    0
                  ],
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_20",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_20",
            "inbound_nodes": [
              [
                [
                  "tf.math.multiply_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_20",
              "trainable": true,
              "dtype": "float32",
              "alpha": 0.20000000298023224
            },
            "name": "leaky_re_lu_20",
            "inbound_nodes": [
              [
                [
                  "conv2d_20",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.square_5",
              "trainable": true,
              "dtype": "float32",
              "function": "math.square"
            },
            "name": "tf.math.square_5",
            "inbound_nodes": [
              [
                "leaky_re_lu_20",
                0,
                0,
                {
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.reduce_mean_5",
              "trainable": true,
              "dtype": "float32",
              "function": "math.reduce_mean"
            },
            "name": "tf.math.reduce_mean_5",
            "inbound_nodes": [
              [
                "tf.math.square_5",
                0,
                0,
                {
                  "axis": 1,
                  "keepdims": true
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.__operators__.add_5",
              "trainable": true,
              "dtype": "float32",
              "function": "__operators__.add"
            },
            "name": "tf.__operators__.add_5",
            "inbound_nodes": [
              [
                "tf.math.reduce_mean_5",
                0,
                0,
                {
                  "y": 1e-08,
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.rsqrt_5",
              "trainable": true,
              "dtype": "float32",
              "function": "math.rsqrt"
            },
            "name": "tf.math.rsqrt_5",
            "inbound_nodes": [
              [
                "tf.__operators__.add_5",
                0,
                0,
                {}
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.multiply_5",
              "trainable": true,
              "dtype": "float32",
              "function": "math.multiply"
            },
            "name": "tf.math.multiply_5",
            "inbound_nodes": [
              [
                "leaky_re_lu_20",
                0,
                0,
                {
                  "y": [
                    "tf.math.rsqrt_5",
                    0,
                    0
                  ],
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d_3",
              "trainable": true,
              "dtype": "float32",
              "size": [
                2,
                2
              ],
              "data_format": "channels_last",
              "interpolation": "nearest"
            },
            "name": "up_sampling2d_3",
            "inbound_nodes": [
              [
                [
                  "tf.math.multiply_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_21",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_21",
            "inbound_nodes": [
              [
                [
                  "up_sampling2d_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_21",
              "trainable": true,
              "dtype": "float32",
              "alpha": 0.20000000298023224
            },
            "name": "leaky_re_lu_21",
            "inbound_nodes": [
              [
                [
                  "conv2d_21",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.square_6",
              "trainable": true,
              "dtype": "float32",
              "function": "math.square"
            },
            "name": "tf.math.square_6",
            "inbound_nodes": [
              [
                "leaky_re_lu_21",
                0,
                0,
                {
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.reduce_mean_6",
              "trainable": true,
              "dtype": "float32",
              "function": "math.reduce_mean"
            },
            "name": "tf.math.reduce_mean_6",
            "inbound_nodes": [
              [
                "tf.math.square_6",
                0,
                0,
                {
                  "axis": 1,
                  "keepdims": true
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.__operators__.add_6",
              "trainable": true,
              "dtype": "float32",
              "function": "__operators__.add"
            },
            "name": "tf.__operators__.add_6",
            "inbound_nodes": [
              [
                "tf.math.reduce_mean_6",
                0,
                0,
                {
                  "y": 1e-08,
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.rsqrt_6",
              "trainable": true,
              "dtype": "float32",
              "function": "math.rsqrt"
            },
            "name": "tf.math.rsqrt_6",
            "inbound_nodes": [
              [
                "tf.__operators__.add_6",
                0,
                0,
                {}
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.multiply_6",
              "trainable": true,
              "dtype": "float32",
              "function": "math.multiply"
            },
            "name": "tf.math.multiply_6",
            "inbound_nodes": [
              [
                "leaky_re_lu_21",
                0,
                0,
                {
                  "y": [
                    "tf.math.rsqrt_6",
                    0,
                    0
                  ],
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_22",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_22",
            "inbound_nodes": [
              [
                [
                  "tf.math.multiply_6",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_22",
              "trainable": true,
              "dtype": "float32",
              "alpha": 0.20000000298023224
            },
            "name": "leaky_re_lu_22",
            "inbound_nodes": [
              [
                [
                  "conv2d_22",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.square_7",
              "trainable": true,
              "dtype": "float32",
              "function": "math.square"
            },
            "name": "tf.math.square_7",
            "inbound_nodes": [
              [
                "leaky_re_lu_22",
                0,
                0,
                {
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.reduce_mean_7",
              "trainable": true,
              "dtype": "float32",
              "function": "math.reduce_mean"
            },
            "name": "tf.math.reduce_mean_7",
            "inbound_nodes": [
              [
                "tf.math.square_7",
                0,
                0,
                {
                  "axis": 1,
                  "keepdims": true
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.__operators__.add_7",
              "trainable": true,
              "dtype": "float32",
              "function": "__operators__.add"
            },
            "name": "tf.__operators__.add_7",
            "inbound_nodes": [
              [
                "tf.math.reduce_mean_7",
                0,
                0,
                {
                  "y": 1e-08,
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.rsqrt_7",
              "trainable": true,
              "dtype": "float32",
              "function": "math.rsqrt"
            },
            "name": "tf.math.rsqrt_7",
            "inbound_nodes": [
              [
                "tf.__operators__.add_7",
                0,
                0,
                {}
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.multiply_7",
              "trainable": true,
              "dtype": "float32",
              "function": "math.multiply"
            },
            "name": "tf.math.multiply_7",
            "inbound_nodes": [
              [
                "leaky_re_lu_22",
                0,
                0,
                {
                  "y": [
                    "tf.math.rsqrt_7",
                    0,
                    0
                  ],
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d_4",
              "trainable": true,
              "dtype": "float32",
              "size": [
                2,
                2
              ],
              "data_format": "channels_last",
              "interpolation": "nearest"
            },
            "name": "up_sampling2d_4",
            "inbound_nodes": [
              [
                [
                  "tf.math.multiply_7",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_23",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_23",
            "inbound_nodes": [
              [
                [
                  "up_sampling2d_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_23",
              "trainable": true,
              "dtype": "float32",
              "alpha": 0.20000000298023224
            },
            "name": "leaky_re_lu_23",
            "inbound_nodes": [
              [
                [
                  "conv2d_23",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.square_8",
              "trainable": true,
              "dtype": "float32",
              "function": "math.square"
            },
            "name": "tf.math.square_8",
            "inbound_nodes": [
              [
                "leaky_re_lu_23",
                0,
                0,
                {
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.reduce_mean_8",
              "trainable": true,
              "dtype": "float32",
              "function": "math.reduce_mean"
            },
            "name": "tf.math.reduce_mean_8",
            "inbound_nodes": [
              [
                "tf.math.square_8",
                0,
                0,
                {
                  "axis": 1,
                  "keepdims": true
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.__operators__.add_8",
              "trainable": true,
              "dtype": "float32",
              "function": "__operators__.add"
            },
            "name": "tf.__operators__.add_8",
            "inbound_nodes": [
              [
                "tf.math.reduce_mean_8",
                0,
                0,
                {
                  "y": 1e-08,
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.rsqrt_8",
              "trainable": true,
              "dtype": "float32",
              "function": "math.rsqrt"
            },
            "name": "tf.math.rsqrt_8",
            "inbound_nodes": [
              [
                "tf.__operators__.add_8",
                0,
                0,
                {}
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.multiply_8",
              "trainable": true,
              "dtype": "float32",
              "function": "math.multiply"
            },
            "name": "tf.math.multiply_8",
            "inbound_nodes": [
              [
                "leaky_re_lu_23",
                0,
                0,
                {
                  "y": [
                    "tf.math.rsqrt_8",
                    0,
                    0
                  ],
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_24",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_24",
            "inbound_nodes": [
              [
                [
                  "tf.math.multiply_8",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_24",
              "trainable": true,
              "dtype": "float32",
              "alpha": 0.20000000298023224
            },
            "name": "leaky_re_lu_24",
            "inbound_nodes": [
              [
                [
                  "conv2d_24",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.square_9",
              "trainable": true,
              "dtype": "float32",
              "function": "math.square"
            },
            "name": "tf.math.square_9",
            "inbound_nodes": [
              [
                "leaky_re_lu_24",
                0,
                0,
                {
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.reduce_mean_9",
              "trainable": true,
              "dtype": "float32",
              "function": "math.reduce_mean"
            },
            "name": "tf.math.reduce_mean_9",
            "inbound_nodes": [
              [
                "tf.math.square_9",
                0,
                0,
                {
                  "axis": 1,
                  "keepdims": true
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.__operators__.add_9",
              "trainable": true,
              "dtype": "float32",
              "function": "__operators__.add"
            },
            "name": "tf.__operators__.add_9",
            "inbound_nodes": [
              [
                "tf.math.reduce_mean_9",
                0,
                0,
                {
                  "y": 1e-08,
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.math.rsqrt_9",
              "trainable": true,
              "dtype": "float32",
